In [1]:
#Name:Vaishali Balaji Akade
#Div:A
#Roll no:01
#collage:Keystone school of engineering,pune

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [6]:
num=np.array([43,54,63,23,12])
num

array([43, 54, 63, 23, 12])

In [7]:
type(num)

numpy.ndarray

In [8]:
num.dtype

dtype('int32')

In [9]:
#series

In [10]:
S=pd.Series([32,12,21,32,34,45])
S

0    32
1    12
2    21
3    32
4    34
5    45
dtype: int64

In [11]:
type(S)

pandas.core.series.Series

In [12]:
S.dtype

dtype('int64')

In [14]:
S.size

6

In [15]:
S.shape

(6,)

In [16]:

#DATAFRAME

In [17]:
r=pd.Series([4,5,6,7,8,9])
n=pd.Series(['test1','test2','test3','test4','test5'])
m=pd.Series([45.56,567.67,53,56.45,44.45])

In [18]:
df=pd.DataFrame({
    'roll':r,
    'name':n,
    'marks':m})

In [19]:
df

   roll   name   marks
0     4  test1   45.56
1     5  test2  567.67
2     6  test3   53.00
3     7  test4   56.45
4     8  test5   44.45
5     9    NaN     NaN

In [20]:
df.shape

(6, 3)

In [21]:
df.size

18

In [22]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [23]:
#Sructured data analysis

In [24]:
df3=pd.read_csv('https://gist.githubusercontent.com/justimchung/9b98c69b30600a46daa6d2e827c31b56/raw/4b1f08ba9b00a2fcd3f7ced9cf9e59062f489c3a/student.csv')

In [25]:
df

  Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE

In [27]:
df.ndim

2

In [28]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [29]:
df.T

,0,1,2,3,4,5,6
Unnamed: 0,s1234567,e1234567,f1357689,e1374659,s7758347,s1334987,e1384726
Name,Peter,Mary,John,Keven,JoJo,Emily,Ubuntu
height,175.0,163.0,180.4,182.5,170.3,168.5,177.0
weight,70.45,55.0,80.3,77.6,50.3,53.6,68.3
sex,1,2,1,1,2,2,1
bdate,1980/4/30,1981/12/21,1980/5/30,1980/11/19,1980/1/27,1982/10/13,1981/7/6
city,Tainan,Taipei,Tainan,Taipei,Taipei,Kaohsiung,Kaohsiung
major,CSIE,EE,Stat,EE,CSIE,CSIE,EE

In [30]:
df.head

<bound method NDFrame.head of   Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE>

In [31]:
df.tail

<bound method NDFrame.tail of   Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE>